Revit 2027 API
ParameterTypeId.ExtrusionLength Property
 "Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExtrusionLength { get; }
Public Shared ReadOnly Property ExtrusionLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExtrusionLength {
	ForgeTypeId^ get ();
}
static member ExtrusionLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace